<?php
    // Ввод данных
    print("Введите границы безопасности показаний\r\n");
    print("Нижняя граница: ");
    $a = intval(fgets(STDIN));
    print("Верхнияя граница: ");
    $b = intval(fgets(STDIN));
    print("Введите показания датчика орбитальной станции\r\n");
    print("0 - конец ввод данных\r\n");
    $n = intval(fgets(STDIN));  // Ввод первого значения уровня помех
    $c = 0;  // Счётчик безопасных показаний
    $d = 0;  // Перемная для сохранения длины участка, где показания безопасны
    $max_len = 0;  // максимальная длину участка, где показания безопасны.
    while ($n != 0)  // Ввод показаний до момента, когда значение не равно 0.
    {
        if (($n >= $a) && ($n <= $b))  // условие безопасности показаний
        {
            $c++;  // Увеличение счётчика безопасных показаний
        }
        else
        {
            $d = $c;  // Если показания опасны, запомнить количество безопасных
            $c = 0;  // и сбросить счётчик.
        }
        /*определить максимальную длину участка,
        где показания безопасны. Если был сброс счётчика
        (прервана цепочка безопасных данных),то максимальной длиной
        будет старое значение счётчика (перемменая "d").
        В противном случае - текущее (новое) значение счётчика
        (переменное "c"). Промежуточный результат*/
        if ($d > $c)
        {
            $m = $d;
        }
        else
        {
            $m = $c;
        }
        // Максимальная длина участка, где показания безопасны.
        // Окончательный ответ.
        if ($m > $max_len)
        {
            $max_len = $m;
        }
        $n = intval(fgets(STDIN));  // ввод следющей порции данных
    }
    // Вывод информации на экран.
    print("Длина интервала, где все показания безопасны: " . $max_len . "\r\n");
?>